
soores = ["حمد",
"بقرة",
"آل عمران",
"نساء",
"مائدة",
"انعام",
"اعراف",
"انفال",
"توبة",
"یونس",
"هود",
"یوسف",
"رعد",
"ابراهیم",
"حجر",
"نحل",
"اسراء",
"کهف",
"مریم",
"طه",
"انبیاء",
"حج",
"مومنون",
"نور",
"فرقان",
"شعراء ",
"نمل",
"قصص",
"عنکبوت",
"روم",
"لقمان",
"سجدة",
"احزاب",
"سبا",
"فاطر",
"یس",
"صافات",
"ص",
"زمر",
"غافر",
"فصلت",
"شوری",
"زخرف",
"دخان",
"جاثیة",
"احقاف",
"محمد (صلی‌الله‌علیه‌وآله‌وسلم)",
"فتح",
"حجرات",
"ق",
"ذاریات",
"طور",
"نجم",
"قمر",
"الرحمن",
"واقعة",
"حدید",
"مجادلة",
"حشر",
"ممتحنة",
"صف",
"جمعة",
"منافقون",
"تغابن",
"طلاق",
"تحریم",
"ملک",
"قلم",
"حاقة",
"معارج",
"نوح",
"جن",
"مزمل",
"مدثر",
"قیامة",
"انسان",
"مرسلات",
"نبا",
"نازعات",
"عبس",
"تکویر",
"انفطار",
"مطففین",
"انشقاق",
"بروج",
"طارق",
"اعلی",
"غاشیة",
"فجر",
"بلد",
"شمس",
"لیل",
"ضحی",
"شرح",
"تین",
"علق",
"قدر",
"بینة",
"زلزال",
"عادیات",
"قارعة",
"تکاثر",
"عصر",
"همزة",
"فیل",
"قریش",
"ماعون",
"کوثر",
"کافرون",
"نصر",
"مسد",
"اخلاص",
"فلق",
"ناس",
]


def soore_show(start, end):
    s_list = []
    counter = 1
    for i in soores:
        if counter < start:
            counter += 1
            continue
        if counter - 1 == end:
            break
        else:
            s_list.append(i)
            counter += 1
    return s_list


def soore_number(soore_name):
    counter = 1
    for i in soores:
        if i == soore_name:
            return counter
        else:
            counter += 1


def soore_name(code):
    counter = 1
    for i in soores:
        if counter == code:
            return i
        else:
            counter += 1
